---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.RuledSurface
source: html/02204fae-ae70-33ea-2f6c-28b40dea2ca6.htm
---
# RuledSurface Members

Creates a Surface object coincident with the ruled surface joining two bounded generating curves.